#include <stdio.h>

int main(int argc, char const *argv[])
{
    int a = 567;
    // m 宽度
    printf("a=%d\n", a);            // 十进制输出
    printf("a=%8d\n", a);           // 十进制输出  8位  不足8位左补5个空格填充
    printf("a=%2d\n", a);           // 十进制输出  2位  超过2位按照实际输出
    printf("str=%8s\n", "goodbye"); // 字符串输出  8位  不足8位左补1个空格填充
    printf("str=%4s\n", "goodbye"); // 字符串输出  4位  超过4位按照实际输出

    // .n
    // 对于实数 ，保留小数点后面的有效位数
    float b = 456.789;
    printf("b=%f\n", b);    // 输出1个实数， 小数点后面保留6位
    printf("b=%.2f\n", b);  // 输出1个实数， 小数点后面保留2位，四舍五入
    printf("b=%.0f\n", b);  // 输出1个实数， 小数点后面保留0位，四舍五入
    printf("b=%8.2f\n", b); // 输出1个实数， 小数点后面保留2位，四舍五入  8位  不足8位左补2个空格填充
    printf("b=%4.2f\n", b); // 输出1个实数， 小数点后面保留2位，四舍五入  4位  超过4位按照实际输出

    // .n
    // 对于字符串 ，控制字符串输出的个数
    printf("b=%s\n", "goodbye");   // 输出1个字符串
    printf("b=%.3s\n", "goodbye"); // 输出1个字符串 ,输出有效字符是goo
    printf("b=%8.3s\n", "goodbye");  // 输出1个字符串  8位  不足8位左补5个空格填充
    printf("b=%3.4s\n", "goodbye");  // 输出1个字符串  4位  超过3位按照实际输出

    // # 
    printf("a=%#o\n",a); // 按照8进制输出1个整数  加上前缀0
    printf("a=%#x\n",a); // 按照16进制输出1个整数  字母小写 加上前缀0x
    printf("a=%#X\n",a); // 按照16进制输出1个整数  字母大写 加上前缀0X

    // +  显示正负
    printf("a=%+d\n",a); // 输出1个整数  加上符号位 ,整数+ ，负数是- 
    a = -123 ; 
    printf("a=%+d\n",a); // 输出1个整数  加上符号位 ,整数+ ，负数是- 

    // - 左对齐， 系统默认是右对齐
    a = 567; 
    printf("a=%-d\n",a); // 输出1个整数   左对齐 
    printf("a=%-8d",a); // 输出1个整数  左对齐  8位  不足8位右补5个空格填充 
    putchar('|');
    printf("a=%-2d",a); // 输出1个整数  左对齐  2位  超过2位按照实际输出
    putchar('|');
    putchar('\n');

    printf("str=%8s|","goodbye");  // 字符串输出  8位  不足8位左补1个空格填充
    printf("str=%-8s|\n","goodbye"); // 字符串输出  8位  不足8位右补1个空格填充


    // 0  数字前面补0
    // 左补0 ， 只限于右对齐的时候使用， 右补0逻辑会有问题，因此 0 和 - 不能同时出现
    printf("a=%08d\n",a); // 输出1个整数  8位  不足8位左补0
    printf("a=%-08d\n",a); // 输出1个整数  8位  不足8位右补0 ， 这个逻辑是错的，自动屏蔽0

    printf("a=%ld\n",a);  // 输出long int 类型的数据
    printf("b=%lf\n",b);  // 输出double 类型的数据


    return 0;
}
